Revit 2027 API
Edge.AsCurveFollowingFace Method
Returns a curve that corresponds to this edge as oriented in its topological direction on the specified face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Curve AsCurveFollowingFace(
	Face faceForDir
)
Public Function AsCurveFollowingFace (
	faceForDir As Face
) As Curve
public:
Curve^ AsCurveFollowingFace(
	Face^ faceForDir
)
member AsCurveFollowingFace :
        faceForDir : Face -> Curve
Parameters
faceForDir Face
Specifies the face, on which the curve will follow the topological direction of the edge.
Return Value
Curve
It can be an Arc, Line, or HermiteSpline.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the specified faceForDir is null.
ArgumentException |  Thrown when the specified faceForDir is not one of the faces for this edge.
Remarks
Evaluating the edge using EvaluateOnFace gives the same result as evaluating the curve returned by AsCurveFollowingFace with a normalized curve parameter. When a Hermite spline is returned, the two evaluated points will be approximately equal.
See Also
Reference
Edge Class
Autodesk.Revit.DB Namespace